#18개의 질문을 통해 자가진단을 진행
#Q1의 답이 0이라면 Q4의 질문으로 답이 1이라면 Q2의 질문으로 넘어가는 방식
#함수 하나씩 질문을 넣어서 해당 질문의 답에 따라서 함수를 호출해주는 방식으로 진행
def Q1():
    print(">>당신의 피부톤은 어떻습니까? (0:하얀색이다, 1:검은색이다)")
    if(Q1 == 0):
    
def Q2():
    print(">>당신의 눈동자색은 무엇입니까? (0:검은색, 1:짙은갈색, 2:밝은갈색)")

def Q3():
    print(">>당신과 잘 어울리는 아이섀도우 계열은 무엇입니까? (0:회색계열, 1:갈색계열)")

def Q4():
    print(">>당신의 눈 인상은 어떻습니까? (0:강한편, 1:부드러운편)")

def Q5():
    print(">>당신에게 어울리는 분홍색은 무엇입니까? (0:핫핑크, 1:코랄핑크)")

def Q6():
    print(">>연분홍색이나 연노란색처럼 포근하고 사랑스러운 색이 잘 어울리나요? (0:어울립니다, 1:어울리지 않습니다)")

def Q7():
    print(">>화장하지 않은 얼굴에 검은색 옷을 입으면 어떻습니까? (0:이목구비가 뚜렷하게 보입니다 1:얼굴색이 안 좋아보입니다)")

def Q8():
    print(">>당신에게 잘 어울리는 액세서리는 무엇입니까? (0:골드제품, 1:실버제품)")

def Q9():
    print(">>황토색, 겨자색, 이끼색, 적갈색처럼 차분하고 고상한 색이 잘 어울리나요? (0:어울립니다, 1:어울리지 않습니다)")

def Q10():
    print(">>당신의 첫인상은 어떻습니까? (0:강한인상, 1:부드러운인상, 2:평범한인상)")

def Q11():
    print(">>햇볕에 노출되면 피부가 어떻게 되나요? (0:잘 탑니다, 1:잘 타지 않습니다, 2:보기에 해당하지 않습니다)")

def Q12():
    print(">>상대방이 보는 당신의 이미지는 어떻습니까? (0:친근감 있고 부드러운 이미지, 1:강하고 차가운 이미지)")

def Q13():
    print(">>당신과 잘 어울리는 색은 무엇입니까? (0:선명한 원색, 1:부드러운 파스텔색)")

def Q14():
    print(">>당신의 얼굴 가까이에 대보았을 때 가장 잘 어울리는 꽃은 무엇입니까? (0:붉은빛의 장미, 1:핑크빛의 튤립)")

def Q15():
    print(">>당신의 머리색은 무엇입니까? (0:진한갈색, 1:진한검은색, 2:밝은갈색, 3:부드러운검은색)")

def Q16():
    print(">>당신의 얼굴은 어려보이는 편입니까? (0:그렇습니다, 1:그렇지 않습니다)")

def Q17():
    print(">>당신에게 잘 어울리는 니트색상은 무엇입니까? (0:노란기가 있는 따뜻한색, 1:푸른기가 있는 차가운색)")

def Q18():
    print(">>당신이 어두운색 정장을 입는다면 어울리는 색상은 무엇입니까? (0:검은색계열, 1:회색계열, 2:어두운갈색계열)")

#출력문 시작
print("FIND YOUR COLOR!")
print("♡쉽고 빠른 자가진단으로 나만의 컬러를 찾아보세요♡\n")
# Q1()
# a = input()
# if(a == 0):
#     Q2()
